//================================================
//
// 敵 [enemy.cpp]
// Author: KENSAKU HATORI
//
//================================================

#include "enemy.h"
#include "enemymanager.h"

// 定数宣言
constexpr int MAX_LIFE = 1; // 体力

//================================================
// コンストラクタ
//================================================
CEnemy::CEnemy()
{
	m_nLife = MAX_LIFE;
}

//================================================
// デストラクタ
//================================================
CEnemy::~CEnemy()
{
}

//================================================
// 初期化処理
//================================================
HRESULT CEnemy::Init(void)
{
	CObjectX::Init();
	return E_NOTIMPL;
}

//================================================
// 終了処理
//================================================
void CEnemy::Uninit(void)
{
	CObjectX::Uninit();
}

//================================================
// 更新処理
//================================================
void CEnemy::Update(void)
{
	// 位置を取得
	D3DXVECTOR3 myPos = GetPosition();

	// 位置をずらす
	myPos += m_Move;

	// 位置を設定
	SetPosition(myPos);

	// 弾との当たり判定
	CEnemyManager::CollisionBullet();

	// 更新
	CObjectX::Update();

	// 死んだら破棄
	if (m_nLife <= 0)
	{
		// 自分をリストから外す
		CEnemyManager::Erase(this);
	}
}

//================================================
// 描画処理
//================================================
void CEnemy::Draw(void)
{
	CObjectX::Draw();
}