//================================================
//
// 分と秒を扱うタイマーのクラスの処理 [DualUnitTimer.h]
// Author:YUTO YOSHIDA
//
//=================================================

//*************************************************
// 多重インクルード防止
//*************************************************
#ifndef _PLAYER_H_
#define _PLAYER_H_

//*************************************************
// インクルードファイル
//*************************************************
#include "character3D.h"

//*************************************************
// プレイヤークラスの定義
//*************************************************
class CPlayer : public CCharacter3D
{
public:
	CPlayer();
	~CPlayer();

	static CPlayer* Create(const D3DXVECTOR3 pos);

private:
};

#endif