//================================================
//
// スコアを表示する処理 [score.h]
// Author:YUTO YOSHIDA
//
//=================================================

//*************************************************
// 多重インクルード防止
//*************************************************
#ifndef _SCORE_H_
#define _SCORE_H_

//*************************************************
// インクルードファイル
//*************************************************
#include "object.h"

//*************************************************
// スコアクラスの定義
//*************************************************
class CScore : public CObject
{
public:
	CScore();
	~CScore();

	static CScore* Create(const D3DXVECTOR3 pos, const D3DXVECTOR2 Size, const int a);
private:
};

#endif