//****************************************************************
//
// チュートリアルの処理[tutorial.h]
// Author Kensaku Hatori
//
//****************************************************************

// インクルード
#include "tutorial.h"
#include "object2D.h"

//***************************************
// コンストラクタ
//***************************************
CTutorial::CTutorial() : CScene(MODE_TUTORIAL)
{
}

//***************************************
// デストラクタ
//***************************************
CTutorial::~CTutorial()
{
}

//***************************************
// 初期化処理
//***************************************
HRESULT CTutorial::Init(void)
{
	CObject2D* LocalTutorial = CObject2D::Create(SCREEN_WIDTH * 0.5f, SCREEN_HEIGHT * 0.5f, { SCREEN_WIDTH * 0.5f ,SCREEN_HEIGHT * 0.5f ,0.0f });
	LocalTutorial->SetTextureID("ttutorial.png");

	return S_OK;
}

//***************************************
// 更新処理
//***************************************
void CTutorial::Update(void)
{
}

//***************************************
// 終了処理
//***************************************
void CTutorial::Uninit(void)
{
}

//***************************************
// 描画処理
//***************************************
void CTutorial::Draw(void)
{
}